Repository: gep/latincheck
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ru

source: Russian
ru: Русский

source: English
ru: Английский

source: Page is not found
ru: Страница не найдена

source: 404. Page is not found
ru: 404. Страница не найдена

source: The page you are looking for does not exist.
ru: Страница, на которую вы сейчас зашли, не существует

source: About cyrillic online validation
ru: Об онлайн валидации кириллицы

source: About
ru: О сервисе

source: This site is created to help developers quickly detect unpleasant cyrillic symbols on the given URL.
ru: Этот сайт создан для того, чтобы помочь разработчикам обнаружить на сайте ненужные символы кириллицы

source: The algorithm works as follows
ru: Алгоритм работает следующим образом

source: The system tries to unzip the contents by the given URL if it's gzipped
ru: Если содержимое сайта зазиповано, то система пытается декомпрессировать его

source: Then the system tries to decode HTML using UTF-8 decoder
ru: Затем система пытается декодировать HTML, используя UTF-8 декодер

source: If failed, then it tries to use CP1251 decoder. If it's failed then KOI8-R, and finally tries UTF-8 decoder and replaces unpleasant symbols
ru: Если предыдущие попытки не увенчались успехом, то тогда используется декодер CP1251. Если же и он зафейлился, то тогда KOI8-R, и наконец в случае тотального провала пытается декодировать с помощью UTF-8, заменяя символы с ошибками

source: On the last step the system calculates the occurrences of cyrillic symbols: line + cyrillic character position(s)
ru: На последнем шаге система считает совпадения по найденным символам кириллицы: номер строки + позиция(ии) кириллической буквы

source: You can try checking URLS using browser address bar:
ru: Можете проверить URL, используя адресную строку броузера

source: or just typing in the URL on the
ru: или введя URL на

source: Home
ru: Главная

source: page
ru: страница

source: The service has a simple API request for those who do not like GUI. Detect cyrillic symbols just using
ru: У данного сервиса есть простой API запрос для тех, кто не любит GUI. Обнаружить кириллицу, просто используя

source: Validate
ru: Проверить

source: request. It returns a JSON object with occurrences line by line.
ru: запрос. Он возвращает JSON объект с найденными совпадениями строка за строкой

source: Verify online any domain for containing non latin characters
ru: Проверь онлайн любой домен на содержание кириллицы

source: Andrey Semikov
ru: Андрей Семиков

source: verification,online,non-latin,cyrillic
ru: проверка,онлайн,нелатиница,кириллица

source: Online cyrillic symbols detection
ru: Онлайн детектор кириллицы

source: Check online any domain for having non-latin symbols
ru: Проверь онлайн любой домен на содержание нелатинских символов

source: Cyrillic symbols detection
ru: Онлайн детектор кириллицы

source: You can quickly verify any website for containing cyrillic symbols in its contents by simply typing the URL below.
ru: Вы можете быстро проверить любой сайт на наличие в его содержимом кириллических символов, просто введя URL.

source: Type any URL
ru: Введи любой URL

source: And verify!
ru: И проверь!

source: Errors
ru: Ошибки

source: No cyrillic symbols found!
ru: Не было найдено кириллицы
